/*Завдання 1. Дани два масиви: А[M] і B[N] (M і N вводяться з клавіатури). Необхідно створити третій масив
мінімально можливого розміру, у якому потрібно зібрати
елементи масиву A, які не включаються до масиву B, без
повторень*/

#include <iostream>
using namespace std;

void inputArr(int* arr, int size) {               //Функція вводу даних у масив.
    for (int i = 0; i < size; i++)
    {
        cout << "Element of " << i + 1 << " massive = ";      //Просимо ввест кор. елементи певного масива 
        cin >> arr[i];
    }
}
void Special(int* arrA, int size1, int* arrB, int size2, int*& arrC, int& size3) {  //Функція збору елементів А які не включають елементи В
    int k = 0;                          //вводимо змінну для розміру масива №3
    for (int i = 0; i < size1; i++)         //перераховуємо елементи масиву А
    {
        for (int j = 0; j < size2; j++)     //Перераховуємо елементи масиву Б через елементи А і виконуємо нижче дії
        {
            if (arrA[i] == arrB[j]) {       //При умові що елемент масА дорівнює ел.масиву В
                break;                      //зупиняємо даний круг циклу
            }
            if (j == size2 - 1) {           //перевірка чи немає співпадінь
                arrC[k] = arrA[i];          //Записуємо елемент масиву у третій масив
                k++;                            //збільшуємо розмір масиву

            }
        }
    }
    size3 = k;          //познчаємо розмір третього масиву 


}
void sortArr(int* arr, int& size) {        //функція для сортування
    int temp = 0;
    for (int i = 0; i < size; i++)      //Перераховуємо усі елементи 
    {
        for (int j = i + 1; j < size; j++)     //перераховуємо усі лементи стартуючи з 2гого
        {
            if (arr[j] < arr[i])   //перевірка - якщо перший елемент більший за другий
            {
                temp = arr[j];
                arr[j] = arr[i];        //міняємо їх місцями
                arr[i] = temp;
            }
        }
    }
}
void parnDel(int* arr, int& size) {     //Функція для видалення парних елементів з масиву
    for (int i = 0; i < size; i++)  //Перераховуємо усі елементи 
    {
        for (int j = i + 1; j < size; j++)  //перераховуємо усі лементи стартуючи з 2гого
        {
            if (arr[i] == arr[j]) {        //перевірка- якщо є парні елементи 
                for (int k = j; k < size - 1; k++) {   //стартуючи цикл перерахунку з другого однакового числа,скорочуємо цикл на 1 круг.
                    arr[k] = arr[k + 1];        //переписуємо що елементи без першого однакового
                }
                size--; //Зменшуємо розмір масиву, так як видалили з нього один елемент
            }
        }
    }
}
void printArr(int* arr, int& size) {

    for (int i = 0; i < size; i++)
    {
        cout << arr[i] << "   ";         // Виводимо на екран третій масив 
    }
}
void twoArrInOne(int*& arrC, int& size3, int*& arrD, int size4) {     //Функція для додавання двох масивів
    int k = 0;      //змінна для збільшення розміру масиву
    for (int i = 0; i < size3; i++)
    {
        arrC[i] = arrC[i];                  //цикл у якому переписали масив
        k++;
    }
    for (int i = 0; i < size4; i++)
    {
        arrC[k] = arrD[i];      //цикл у якому до 1го масиву додаємо 2гий
        k++;
    }
    size3 = k;          //збільшуємо розмір масиву до потрібного 

}


int main()
{
    int size1 = 0;      //змінна для розміру 1го масиву
    int size2 = 0;      //змінна для розміру 2го масиву
    cout << "Enter size of A massive = ";   //Просимо кор ввести розмір першого масиву 
    cin >> size1;
    int* arrA = new int[size1];             //Присвоюємо масиву А розмір який ввів кор.

    cout << "Enter size of B massive = ";      //Просимо кор ввести розмір другого масиву 
    cin >> size2;
    int* arrB = new int[size1];                 //Присвоюємо масиву В розмір який ввів кор.

    cout << endl; //для зручності
    cout << "Please, enter elements of massive A:" << endl;
    inputArr(arrA, size1);                 //Викликаємо ф-цію вводу масиву для А
    cout << endl; //для зручності
    cout << "Please, enter elements of massive B:" << endl;
    inputArr(arrB, size2);                 //Викликаємо ф-цію вводу масиву для В

    int size3 = 100;          //Змінна для розміру 3го масиву 
    int* arrC = new int[size3];     //Змінна для третього масиву 

    int size4 = 100;          //Змінна для розміру 4го масиву 
    int* arrD = new int[size4];     //Змінна для 4uj масиву 

    Special(arrA, size1, arrB, size2, arrC, size3);     //Викликаємо функцію для збору елементів(яку зробили у попередньому завданні)
    Special(arrB, size2, arrA, size1, arrD, size4);     //Викликаємо функцію для збору елементів(яку зробили у попередньому завданні) тільки змінюємо дані які відправляємо 
    twoArrInOne(arrC, size3, arrD, size4);      //склеюємо наші масиви-шляхом допису до масиву arrC
    sortArr(arrC, size3);          //Викликаємо функцію для сортування
    parnDel(arrC, size3);           //Викликаємо функцію для видалення парних елементів
    printArr(arrC, size3);          //Виводимо третій масив на екран через функцію.




}

